PinkFluffyUnic0rn/stm32flight/main.c
	// update battery voltage
	writelog(LOG_BAT, dsp_getlpf(Lpf + LPF_BAT));

	// toggle arming indication led
	HAL_GPIO_WritePin(armgpio, armpin,
		(En > 0.5) ? GPIO_PIN_SET : GPIO_PIN_RESET);

	// update acceleration, speed, position,
	// rotation speed, and rotation for all 3 axes
	updateposition(dt);

	// get correction values for roll, pitch, yaw and thrust
	updatecorrection(dt, &cor);

	// apply thrust to motors
	applythrust(&cor);

	// update loops counter
	++Loops;

	return 0;
}

/**
* @brief Check if ERLS connection is alive, disarm if not. Callback
	for TEV_CHECK periodic event.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int checkconnection(int ms)
{
	// decrease ERLS timeout counter
	if (Elrstimeout != 0)
		--Elrstimeout;

	// if timeout conter reached 0 and no ERLS
	// packet came, disarm immediately
	if (Elrstimeout <= 0) {
		Emergencydisarm = 1;
		setthrust(Dev + DEV_DSHOT, 0.0, 0.0, 0.0, 0.0);
		En = 0.0;
	}

	// since it runs every 1 second update loop counter here too
	Loopscount = Loops;
	Loops = 0;

	return 0;
}

/**
* @brief Get readings from barometer. Callback for
	TEV_BARO periodic event.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int baroupdate(int ms)
{
	// if barometer isn't initilized, return
	if (Dev[DEV_BARO].status != DEVSTATUS_INIT)
		return 0;

	// read barometer values
	Dev[DEV_BARO].read(Dev[DEV_BARO].priv, &Barodata,
		sizeof(struct baro_data));

	// write barometer temperature and altitude values into log
	writelog(LOG_BAR_TEMP, Barodata.tempf);
	writelog(LOG_BAR_ALT, Barodata.altf);

	// update altitude low-pass filter and temperature reading
	dsp_updatelpf(Lpf + LPF_ALT, Barodata.altf);
	dsp_updatelpf(Lpf + LPF_BARTEMP, Barodata.tempf);

	return 0;
}

/**
* @brief Get readings from magnetomer. Callback for TEV_MAG
	periodic event.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int magupdate(int ms)
{
	// if magnetometer isn't initilized, return
	if (Dev[DEV_MAG].status != DEVSTATUS_INIT)
		return 0;

	Dev[DEV_MAG].read(Dev[DEV_MAG].priv, &Magdata,
		sizeof(struct mag_data));

	// apply offsets to magnetometer values
	Magdata.fx = St.adj.magsc.x * (Magdata.fx + St.adj.mag0.x);
	Magdata.fy = St.adj.magsc.y * (Magdata.fy + St.adj.mag0.y);
	Magdata.fz = St.adj.magsc.z * (Magdata.fz + St.adj.mag0.z);

	// apply scaling to magnetometer values
	Magdata.fx += St.adj.magthrsc.x * dsp_getlpf(Lpf + LPF_AVGTHR);
	Magdata.fy += St.adj.magthrsc.y * dsp_getlpf(Lpf + LPF_AVGTHR);
	Magdata.fz += St.adj.magthrsc.z * dsp_getlpf(Lpf + LPF_AVGTHR);

	// write magnetometer values into log
	writelog(LOG_MAG_X, Magdata.fx);
	writelog(LOG_MAG_Y, Magdata.fy);
	writelog(LOG_MAG_Z, Magdata.fz);

	// update magnetometer values lpf
	dsp_updatelpf(Lpf + LPF_MAGX, Magdata.fx);
	dsp_updatelpf(Lpf + LPF_MAGY, Magdata.fy);
	dsp_updatelpf(Lpf + LPF_MAGZ, Magdata.fz);

	return 0;
}

/**
* @brief Update log frame. If buffer isn't full, just move
	buffer pointer, otherwise save buffer content into flash and
	set buffer pointer to 0.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int logupdate(int ms)
{
	updatelog();

	return 0;
}

/**
* @brief Send telemetry through ELRS.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int telesend(int ms)
{
	const char *attmodestr[] = {"ac", "st", "sp", "ps"};
	const char *yawmodestr[] = {"sp", "cs"};
	const char *altmodestr[] = {"tr", "cl", "al"};
	const char *am;

	Tele.bat = dsp_getlpf(Lpf + LPF_BAT);
	Tele.curr = dsp_getlpf(Lpf + LPF_CUR);

	// Determine battery series cells count using it voltage
	// and calculate it's remaining charge in percents
	if (Tele.bat < 6.0)
		Tele.batrem = (Tele.bat - 3.5) / 0.7;
	else if (Tele.bat < 9.0)
		Tele.batrem = (Tele.bat - 7.0) / 1.4;
	else if (Tele.bat < 13.5)
		Tele.batrem = (Tele.bat - 10.5) / 2.1;
	else if (Tele.bat < 18.0)
		Tele.batrem = (Tele.bat - 14) / 2.8;
	else
		Tele.batrem = (Tele.bat - 21) / 3.5;

	Tele.batrem = trimf(100.0 * Tele.batrem, 0.0, 100.0);

	Tele.lat = Gnss.declat;
	Tele.lon = Gnss.declon;
	Tele.speed = dsp_getlpf(Lpf + LPF_SPEED);
	Tele.course = Gnss.course;
	Tele.alt = Gnss.altitude;
	Tele.sats = Gnss.satellites;
	Tele.balt = dsp_getcompl(Cmpl + CMPL_ALT) - Alt0;
	Tele.vspeed = dsp_getcompl(Cmpl + CMPL_CLIMBRATE);
	Tele.roll = dsp_getlpf(Lpf + LPF_ROLL);
	Tele.pitch = dsp_getlpf(Lpf + LPF_PITCH);
	Tele.yaw = dsp_getlpf(Lpf + LPF_YAW);

	// fill flight mode string with arm state and
	// combination of stabilization modes codes
	if (Altmode == ALTMODE_ACCEL)
		am = altmodestr[0];
	else if (Altmode == ALTMODE_SPEED)
		am = altmodestr[1];
	else if (Altmode == ALTMODE_POS)
		am = altmodestr[2];
	else
		am = "---";

	Tele.mode[0] = En > 0.5 ? 'a' : 'n';
	Tele.mode[1] = '|';
	
	if (Gnssmode == GNSSMODE_SPEED)
		memcpy(Tele.mode + 2, attmodestr[2], 2);
	else if (Gnssmode == GNSSMODE_POS)
		memcpy(Tele.mode + 2, attmodestr[3], 2);
	else
		memcpy(Tele.mode + 2, attmodestr[Speedpid ? 0 : 1], 2);
	
	Tele.mode[4] = '|';
	memcpy(Tele.mode + 5, yawmodestr[Yawspeedpid ? 0 : 1], 2);
	Tele.mode[7] = '|';
	memcpy(Tele.mode + 8, am, 2);

	// in case of emergency disarming
	// set flight mode to "stopped"
	if (Emergencydisarm)
		strcpy((char *) Tele.mode, "stopped");

	// perform telemetry write step	on CRSF eLRS
	// reciever to send it back to remote
	Dev[DEV_CRSF].write(Dev[DEV_CRSF].priv, &Tele,
		sizeof(struct crsf_tele));

	Osd.armed = (En > 0.5) ? 1 : 0;
	Osd.attmode = Speedpid ? MSP_ATTMODE_GYRO : MSP_ATTMODE_ACC;
	Osd.yawmode = Yawspeedpid ? MSP_YAWMODE_GYRO : MSP_YAWMODE_MAG;

	if (Altmode == ALTMODE_ACCEL)
		Osd.altmode = MSP_ALTMODE_ACCEL;
	else if (Altmode == ALTMODE_SPEED)
		Osd.altmode = MSP_ALTMODE_SPEED;
	else if (Altmode == ALTMODE_POS)
		Osd.altmode = MSP_ALTMODE_POS;

	if (Gnssmode == GNSSMODE_NONE)
		Osd.gnssmode = MSP_GNSSMODE_NONE;
	else if (Gnssmode == GNSSMODE_SPEED)
		Osd.gnssmode = MSP_GNSSMODE_SPEED;
	else if (Gnssmode == GNSSMODE_POS)
		Osd.gnssmode = MSP_GNSSMODE_POS;

	Osd.bat = Tele.bat;
	Osd.curr = Tele.curr;
	Osd.batrem = Tele.batrem;
	Osd.lat = Tele.lat;
	Osd.lon = Tele.lon;
	Osd.speed = Tele.speed;
	Osd.course = Tele.course;
	Osd.alt = Tele.balt;
	Osd.sats = Tele.sats;
	Osd.vspeed = Tele.vspeed;
	Osd.temp = dsp_getlpf(Lpf + LPF_BARTEMP);
	Osd.roll = Tele.roll;
	Osd.pitch = Tele.pitch;
	Osd.yaw = Tele.yaw;

