PinkFluffyUnic0rn/stm32flight/main.c
		Rolltarget = cd->chf[ERLS_CH_ROLL]
			* (M_PI * St.rollmax);
	}
	else 
	*/	
	if (cd->chf[ERLS_CH_ATTMODE] > 0.25) {
		int changed;

		changed = (En == 0 || Speedpid == 1);

		En = 1;
		Speedpid = 0;
		
		if (changed)	
			setstabilize(0);

		// set pitch/roll targets based on
		// channels 1-2 values (it's a joystick on most remotes)
		Rolltarget = cd->chf[ERLS_CH_ROLL]
			* (M_PI * St.ctrl.rollmax);
		Pitchtarget = -cd->chf[ERLS_CH_PITCH]
			* (M_PI * St.ctrl.pitchmax);
	}
	else if (cd->chf[ERLS_CH_ATTMODE] < -0.25) {
		En = 0;
		Speedpid = 0;
	}
	else {
		int changed;

		changed = (En == 0 || Speedpid == 0);

		En = 1;
		Speedpid = 1;
		
		if (changed)	
			setstabilize(0);

		// set pitch/roll targets based on
		// channels 1-2 values (it's a joystick on most remotes)
		Rolltarget = cd->chf[ERLS_CH_ROLL]
			* (M_PI * St.ctrl.rollrate);
		Pitchtarget = -cd->chf[ERLS_CH_PITCH]
			* (M_PI * St.ctrl.pitchrate);
	}

	if (cd->chf[ERLS_CH_GNSSMODE] > 0.25
			&& Dev[DEV_GNSS].status == DEVSTATUS_INIT
			&& M10_HASFIX(Gnss.quality)) {
		float yaw;

		Gnssmode = GNSSMODE_POS;

		yaw = dsp_getlpf(Lpf + LPF_YAW);

		Rolltarget += dt * (cd->chf[ERLS_CH_PITCH] * sinf(yaw)
			+ cd->chf[ERLS_CH_ROLL] * cosf(yaw))
				* St.ctrl.posrate;

		Pitchtarget += dt * (cd->chf[ERLS_CH_PITCH] * cosf(yaw)
			- cd->chf[ERLS_CH_ROLL] * sinf(yaw))
				* St.ctrl.posrate;
	}
	else if (cd->chf[ERLS_CH_GNSSMODE] > -0.25
			&& Dev[DEV_GNSS].status == DEVSTATUS_INIT
			&& M10_HASFIX(Gnss.quality)) {
		Gnssmode = GNSSMODE_SPEED;

		Rolltarget = cd->chf[ERLS_CH_ROLL] * St.ctrl.speedrate;
		Pitchtarget = cd->chf[ERLS_CH_PITCH]
			* St.ctrl.speedrate;
	}
	else {
		Gnssmode = GNSSMODE_NONE;
	}

	// disable thrust when motors should be
	// disabled, for additional safety
	if (En < 0.5)
		setthrust(Dev + DEV_DSHOT, 0.0, 0.0, 0.0, 0.0);

	return 0;
}

/**
* @brief Store data got from NMEA message.
* @param nd data got from GNSS device through NMEA protocol
* @return always 0
*/
int m10msg(struct m10_data *nd)
{
	// got only altitude and signal quality data from GGA messages.
	if (nd->type == M10_TYPE_GGA) {
		Gnss.altitude = nd->gga.alt;
		Gnss.quality = nd->gga.quality;
		Gnss.satellites = nd->gga.sats;

		// write GGA values into log
		writelog(LOG_GNSS_ALT, Gnss.altitude);
		writelog(LOG_GNSS_QUAL, Gnss.quality);
		writelog(LOG_GNSS_SATS, Gnss.satellites);

		return 0;
	}

	// other needed data is got from RMC
	// messages. Discard all other messages.
	if (nd->type != M10_TYPE_RMC)
		return 0;

	Gnss.time = nd->rmc.time;
	memcpy(Gnss.date, nd->rmc.date, 10);

	Gnss.latmin = nd->rmc.latmin;
	Gnss.lat = nd->rmc.lat;
	Gnss.latdir = (tolower(nd->rmc.latdir) == 'n')
		? LATDIR_N : LATDIR_S;
	Gnss.declat = Gnss.lat + Gnss.latmin / 60.0;

	Gnss.lonmin = nd->gga.lonmin;
	Gnss.lon = nd->rmc.lon;
	Gnss.londir = (tolower(nd->rmc.londir) == 'e')
		? LONDIR_E : LONDIR_W;
	Gnss.declon = Gnss.lon + Gnss.lonmin / 60.0;

	Gnss.magvar = nd->rmc.magvar;
	Gnss.magvardir = (tolower(nd->rmc.magvardir) == 'e')
		? MAGVARDIR_E : MAGVARDIR_W;

	Gnss.speed = nd->rmc.speed;
	Gnss.course = circf(deg2rad(nd->rmc.course));

	// write RMC values into log
	writelog(LOG_GNSS_LAT, Gnss.declat);
	writelog(LOG_GNSS_LON, Gnss.declon);
	writelog(LOG_GNSS_SPEED, Gnss.speed);
	writelog(LOG_GNSS_COURSE, Gnss.course);

	// Calculate distance from starting point
	// through latitude and longitude in meters
	dsp_updatelpf(Lpf + LPF_LATM, (Gnss.declat - Lat0) * 111320);
	dsp_updatelpf(Lpf + LPF_LONM,
		(Gnss.declon - Lon0) * 111320 * cosf(deg2rad(Lat0)));

	writelog(LOG_CUSTOM0, dsp_getlpf(Lpf + LPF_LATM));
	writelog(LOG_CUSTOM1, dsp_getlpf(Lpf + LPF_LONM));
	writelog(LOG_CUSTOM2, deg2rad(Gnss.course));

	return 0;
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef* htim)
{
	static int elrsus = 0;

	char cmd[CMDSIZE];
	struct crsf_data cd;
	struct m10_data nd;
	int c, i;

	if (htim->Instance != pconf_schedhtim->Instance)
		return;

	if (!Init)
		return;

	c = TICKSPERSEC / PID_FREQ;

	// update periodic events timers
	for (i = 0; i < TEV_COUNT; ++i)
		updatetimev(Evs + i, c);

	// update ELRS timer
	elrsus += c;

	// check all periodic events context's and run callbacks
	// if enough time passed. Reset their timers after.
	for (i = 0; i < TEV_COUNT; ++i) {
		if (checktimev(Evs + i))
			runtimev(Evs + i);
	}

	// poll for configuration and telemetry commands
	// from debug wifi connection
	if (Dev[DEV_RF].read(Dev[DEV_RF].priv, &cmd,
			CMDSIZE) >= 0) {
		runcommand(Dev + DEV_RF, cmd);
	}

	// poll for configuration and telemtry commands
	// from debug uart connection
	if (Dev[DEV_UART].read(Dev[DEV_UART].priv, &cmd,
			UART_CMDSIZE) >= 0) {
		runcommand(Dev + DEV_UART, cmd);
	}

	// read the ELRS remote's packet
	if (Dev[DEV_CRSF].read(Dev[DEV_CRSF].priv, &cd,
			sizeof(struct crsf_data)) >= 0) {
		crsfcmd(&cd, elrsus);
		elrsus = 0;
	}

	// check the M10 messages
	if (Dev[DEV_GNSS].read(Dev[DEV_GNSS].priv, &nd,
			sizeof(struct m10_data)) >= 0) {
		m10msg(&nd);
	}
}

/**
* @brief Entry point
* @return always 0
*/
int main(void)
{
	// init periphery
	pconf_init(error_handler);
	
	// reading settings from memory current
	// memory slot, which is 0 at start
	readsettings(Curslot);

	// set IRC VTX power and frequency using values from settings
	updatevtx();

	// initialize stabilization routine
	setstabilize(1);

	// initilize periodic events
	inittimev(Evs + TEV_IMU, 0, PID_FREQ, imuupdate);
	inittimev(Evs + TEV_LOG, 0, St.log.freq,  logupdate);
	inittimev(Evs + TEV_PID, 0, PID_FREQ, stabilize);
	inittimev(Evs + TEV_CHECK,
		1 * PID_FREQ / TEV_COUNT * (TICKSPERSEC / PID_FREQ),
		CHECK_FREQ, checkconnection);
	inittimev(Evs + TEV_BARO,
		2 * PID_FREQ / TEV_COUNT * (TICKSPERSEC / PID_FREQ),
		DPS_FREQ, baroupdate);
	inittimev(Evs + TEV_MAG,
		3 * PID_FREQ / TEV_COUNT * (TICKSPERSEC / PID_FREQ),
		QMC_FREQ, magupdate);
	inittimev(Evs + TEV_TELE,
		5 * PID_FREQ / TEV_COUNT * (TICKSPERSEC / PID_FREQ),
		TELE_FREQ, telesend);
	inittimev(Evs + TEV_POWER,
		6 * PID_FREQ / TEV_COUNT * (TICKSPERSEC / PID_FREQ),
		POWER_FREQ, powercheck);
	inittimev(Evs + TEV_AUTOPILOT,
		7 * PID_FREQ / TEV_COUNT * (TICKSPERSEC / PID_FREQ),
		AUTOPILOT_FREQ, autopilotupdate);

	// initilize debug commands
	addcommand("r", rcmd);
	addcommand("info", infocmd);
	addcommand("flash", flashcmd);
	addcommand("system", systemcmd);
	addcommand("log", logcmd);
	addcommand("motor", motorcmd);
	addcommand("autopilot", autopilotcmd);
	addcommand("set", setcmd);
	addcommand("get", getcmd);
	addcommand("apply", applycmd);

	__HAL_TIM_SET_COUNTER(pconf_schedhtim, 0);

	Init = 1;

	// main control loop
	while (1) { }

	return 0;
}
